clear all
format short
%% 参数初始化
P = 760; %压强
a = [18.607; 15.841; 20.443; 19.293];
b = [2643.31; 2755.64; 4628.96; 4117.07];
c = [239.73; 219.16; 252.64; 227.44];
Q = [1.0, 0.192, 2.169, 1.611;
    0.316, 1.0, 0.477, 0.524;
    0.377, 0.360, 1.0, 0.296;
    0.524, 0.282, 2.065, 1.0];
%% 导入历史上获得的结果
XT0Set = [0.250, 0.250, 0.250, 50;
      0.1660, 0.1036, 0.4042, 257.2774;
      0.4728, 0.1248, 0.3097, 7.7877;
      0.1980, 0.1305, 0.3193, 246.3052;
      0.4850, 0.3378, 0.0076,77.9677;
      0.3655, 0.2870, 0.0915, 84.4636;
      0.2359, 0.2401, 0.2438, 215.1513;
       0.2856, 0.0287, 0.5484, 223.4745]; %已知不同解的迭代初始值集合
resultSet = []; %已知的结果集合
YSet = []; %结果集合所对应的Y值的集合
for i = 1:length(XT0Set(:,1))
    [XT, Y] = fsolve(@gongfeihunhe, XT0Set(i,:), [], a, b, c, P, Q);
    resultSet = [resultSet; XT];
    YSet = [YSet; Y];
end
%% 随机生成若干组新的初始值，如果与之前结果不同则终止，否则直到达到尝试上限时终止
trymax = 2000; %尝试上限
for trytime = 1:trymax
    XT0 = getRandom(length(a));
    [XT, Y] = fsolve(@gongfeihunhe, XT0, [], a, b, c, P, Q);
    for j = 1:length(XT0Set(:,1))
        sums(j) = sum(abs(resultSet(j,:)-XT));
    end
    if (min(sums) > 4e-4)
        break;
    end
end